/*

Задача. Пользователем с клавиатуры вводится целое число N > 0. В программе
сформируйте и выведите целочисленный массив из N элементов. Значениями
элементов – степени 2 от нулевой до N-1 (1, 2, … 2^(N-1)).

// N должен быть до 56, т.к. иначе значение выходит из выделенной память (double, 8 байт).

*/

// Ввод переменной N и её проверка.
Console.Write("Введите N (от 1 до 56): ");
bool isN = int.TryParse(Console.ReadLine(), out int n);
if (!isN || n < 1 || n > 56) return;

// Массив типа double, т.к. для него выделяется больше памяти чем под int
double[] arr = new double[n];
for (int i = 0; i < arr.Length; i++)
{
    arr[i] = Math.Pow(2, i);
}

// Вывод массива.
Console.WriteLine($"\nВаш массив:");
foreach (int item in arr)
{
    Console.Write($"{item}  ");
}
