/*

Пользователем с клавиатуры вводится целое число N > 1. В программе
сформируйте целочисленный массив, содержащий N первых элементов
последовательности Фибоначчи: 

A[0] = 1
A[1] = 1
A[2] = A[0] + A[1]
A[K] = A[K-1] + A[K-2]
 
 */



// Ввод переменной N и её проверка.
Console.Write("Введите N: ");
bool isN = int.TryParse(Console.ReadLine(), out int n);
if (!isN || n < 2) return;

// Формирование массива.
int[] arr = new int[n];

// Ввод первых двух переменных. Гарантируется, что минимальная длина массива будет 2. 
arr[0] = arr[1] = 1;

// Генерация чисел Фибоначи.
for (int i = 2; i < arr.Length; i++)
{
    arr[i] = arr[i - 2] + arr[i - 1];
}

// Вывод массива.
Console.WriteLine($"\nВаш массив:");
foreach (int item in arr)
{
    Console.Write($"{item}  ");
}

